```
 Terraform will perform the following actions:
04:58:08.657 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-a"] will be created
04:58:08.657 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
04:58:08.657 STDOUT terraform:       + id          = (known after apply)
04:58:08.657 STDOUT terraform:       + policy      = jsonencode(
04:58:08.657 STDOUT terraform:             {
04:58:08.657 STDOUT terraform:               + rules = [
04:58:08.657 STDOUT terraform:                   + {
04:58:08.657 STDOUT terraform:                       + action       = {
04:58:08.657 STDOUT terraform:                           + type = "expire"
04:58:08.657 STDOUT terraform:                         }
04:58:08.657 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
04:58:08.657 STDOUT terraform:                       + rulePriority = 1
04:58:08.657 STDOUT terraform:                       + selection    = {
04:58:08.657 STDOUT terraform:                           + countNumber = 3
04:58:08.657 STDOUT terraform:                           + countType   = "sinceImagePushed"
04:58:08.657 STDOUT terraform:                           + countUnit   = "days"
04:58:08.657 STDOUT terraform:                           + tagStatus   = "untagged"
04:58:08.657 STDOUT terraform:                         }
04:58:08.657 STDOUT terraform:                     },
04:58:08.657 STDOUT terraform:                   + {
04:58:08.657 STDOUT terraform:                       + action       = {
04:58:08.657 STDOUT terraform:                           + type = "expire"
04:58:08.657 STDOUT terraform:                         }
04:58:08.657 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
04:58:08.658 STDOUT terraform:                       + rulePriority = 2
04:58:08.658 STDOUT terraform:                       + selection    = {
04:58:08.658 STDOUT terraform:                           + countNumber    = 7
04:58:08.658 STDOUT terraform:                           + countType      = "imageCountMoreThan"
04:58:08.658 STDOUT terraform:                           + tagPatternList = [
04:58:08.658 STDOUT terraform:                               + "*pull_request*",
04:58:08.658 STDOUT terraform:                             ]
04:58:08.658 STDOUT terraform:                           + tagStatus      = "tagged"
04:58:08.658 STDOUT terraform:                         }
04:58:08.658 STDOUT terraform:                     },
04:58:08.658 STDOUT terraform:                   + {
04:58:08.658 STDOUT terraform:                       + action       = {
04:58:08.658 STDOUT terraform:                           + type = "expire"
04:58:08.658 STDOUT terraform:                         }
04:58:08.658 STDOUT terraform:                       + description  = "Expire images older than 50 days."
04:58:08.658 STDOUT terraform:                       + rulePriority = 3
04:58:08.658 STDOUT terraform:                       + selection    = {
04:58:08.658 STDOUT terraform:                           + countNumber = 50
04:58:08.658 STDOUT terraform:                           + countType   = "imageCountMoreThan"
04:58:08.658 STDOUT terraform:                           + tagStatus   = "any"
04:58:08.658 STDOUT terraform:                         }
04:58:08.658 STDOUT terraform:                     },
04:58:08.658 STDOUT terraform:                 ]
04:58:08.658 STDOUT terraform:             }
04:58:08.658 STDOUT terraform:         )
04:58:08.658 STDOUT terraform:       + registry_id = (known after apply)
04:58:08.658 STDOUT terraform:       + repository  = "microservice-a"
04:58:08.658 STDOUT terraform:     }
04:58:08.658 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-b"] will be created
04:58:08.658 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
04:58:08.658 STDOUT terraform:       + id          = (known after apply)
04:58:08.658 STDOUT terraform:       + policy      = jsonencode(
04:58:08.658 STDOUT terraform:             {
04:58:08.658 STDOUT terraform:               + rules = [
04:58:08.658 STDOUT terraform:                   + {
04:58:08.658 STDOUT terraform:                       + action       = {
04:58:08.658 STDOUT terraform:                           + type = "expire"
04:58:08.658 STDOUT terraform:                         }
04:58:08.658 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
04:58:08.659 STDOUT terraform:                       + rulePriority = 1
04:58:08.659 STDOUT terraform:                       + selection    = {
04:58:08.659 STDOUT terraform:                           + countNumber = 3
04:58:08.659 STDOUT terraform:                           + countType   = "sinceImagePushed"
04:58:08.659 STDOUT terraform:                           + countUnit   = "days"
04:58:08.659 STDOUT terraform:                           + tagStatus   = "untagged"
04:58:08.659 STDOUT terraform:                         }
04:58:08.659 STDOUT terraform:                     },
04:58:08.659 STDOUT terraform:                   + {
04:58:08.659 STDOUT terraform:                       + action       = {
04:58:08.659 STDOUT terraform:                           + type = "expire"
04:58:08.659 STDOUT terraform:                         }
04:58:08.659 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
04:58:08.659 STDOUT terraform:                       + rulePriority = 2
04:58:08.659 STDOUT terraform:                       + selection    = {
04:58:08.659 STDOUT terraform:                           + countNumber    = 7
04:58:08.659 STDOUT terraform:                           + countType      = "imageCountMoreThan"
04:58:08.659 STDOUT terraform:                           + tagPatternList = [
04:58:08.659 STDOUT terraform:                               + "*pull_request*",
04:58:08.659 STDOUT terraform:                             ]
04:58:08.659 STDOUT terraform:                           + tagStatus      = "tagged"
04:58:08.659 STDOUT terraform:                         }
04:58:08.659 STDOUT terraform:                     },
04:58:08.659 STDOUT terraform:                   + {
04:58:08.659 STDOUT terraform:                       + action       = {
04:58:08.659 STDOUT terraform:                           + type = "expire"
04:58:08.659 STDOUT terraform:                         }
04:58:08.659 STDOUT terraform:                       + description  = "Expire images older than 50 days."
04:58:08.659 STDOUT terraform:                       + rulePriority = 3
04:58:08.659 STDOUT terraform:                       + selection    = {
04:58:08.659 STDOUT terraform:                           + countNumber = 50
04:58:08.659 STDOUT terraform:                           + countType   = "imageCountMoreThan"
04:58:08.660 STDOUT terraform:                           + tagStatus   = "any"
04:58:08.660 STDOUT terraform:                         }
04:58:08.660 STDOUT terraform:                     },
04:58:08.660 STDOUT terraform:                 ]
04:58:08.660 STDOUT terraform:             }
04:58:08.660 STDOUT terraform:         )
04:58:08.660 STDOUT terraform:       + registry_id = (known after apply)
04:58:08.660 STDOUT terraform:       + repository  = "microservice-b"
04:58:08.660 STDOUT terraform:     }
04:58:08.660 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-a"] will be created
04:58:08.660 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
04:58:08.660 STDOUT terraform:       + arn                  = (known after apply)
04:58:08.660 STDOUT terraform:       + id                   = (known after apply)
04:58:08.660 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
04:58:08.660 STDOUT terraform:       + name                 = "microservice-a"
04:58:08.660 STDOUT terraform:       + registry_id          = (known after apply)
04:58:08.660 STDOUT terraform:       + repository_url       = (known after apply)
04:58:08.660 STDOUT terraform:       + tags                 = {
04:58:08.660 STDOUT terraform:           + "Environment" = "dev"
04:58:08.660 STDOUT terraform:           + "Terragrunt"  = "true"
04:58:08.660 STDOUT terraform:         }
04:58:08.660 STDOUT terraform:       + tags_all             = {
04:58:08.660 STDOUT terraform:           + "Data-classification" = "internal"
04:58:08.660 STDOUT terraform:           + "Environment"         = "dev"
04:58:08.660 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:58:08.660 STDOUT terraform:           + "Organization"        = "genopsx"
04:58:08.660 STDOUT terraform:           + "Terragrunt"          = "true"
04:58:08.660 STDOUT terraform:         }
04:58:08.660 STDOUT terraform:       + image_scanning_configuration {
04:58:08.660 STDOUT terraform:           + scan_on_push = true
04:58:08.660 STDOUT terraform:         }
04:58:08.660 STDOUT terraform:     }
04:58:08.660 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-b"] will be created
04:58:08.660 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
04:58:08.660 STDOUT terraform:       + arn                  = (known after apply)
04:58:08.660 STDOUT terraform:       + id                   = (known after apply)
04:58:08.660 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
04:58:08.660 STDOUT terraform:       + name                 = "microservice-b"
04:58:08.660 STDOUT terraform:       + registry_id          = (known after apply)
04:58:08.660 STDOUT terraform:       + repository_url       = (known after apply)
04:58:08.661 STDOUT terraform:       + tags                 = {
04:58:08.661 STDOUT terraform:           + "Environment" = "dev"
04:58:08.661 STDOUT terraform:           + "Terragrunt"  = "true"
04:58:08.661 STDOUT terraform:         }
04:58:08.661 STDOUT terraform:       + tags_all             = {
04:58:08.661 STDOUT terraform:           + "Data-classification" = "internal"
04:58:08.661 STDOUT terraform:           + "Environment"         = "dev"
04:58:08.661 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:58:08.661 STDOUT terraform:           + "Organization"        = "genopsx"
04:58:08.661 STDOUT terraform:           + "Terragrunt"          = "true"
04:58:08.661 STDOUT terraform:         }
04:58:08.661 STDOUT terraform:       + image_scanning_configuration {
04:58:08.661 STDOUT terraform:           + scan_on_push = true
04:58:08.661 STDOUT terraform:         }
04:58:08.661 STDOUT terraform:     }
04:58:08.661 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
04:58:08.661 STDOUT terraform: 
04:58:08.661 STDOUT terraform: Changes to Outputs:
04:58:08.661 STDOUT terraform:   + repositories_arns = {
04:58:08.661 STDOUT terraform:       + microservice-a = (known after apply)
04:58:08.661 STDOUT terraform:       + microservice-b = (known after apply)
04:58:08.661 STDOUT terraform:     }
04:58:08.661 STDOUT terraform:   + repositories_urls = {
04:58:08.661 STDOUT terraform:       + microservice-a = (known after apply)
04:58:08.661 STDOUT terraform:       + microservice-b = (known after apply)
04:58:08.661 STDOUT terraform:     }
04:58:08.661 STDOUT terraform: 
04:58:08.661 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
04:58:08.661 STDOUT terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
04:58:08.661 STDOUT terraform: guarantee to take exactly these actions if you run "terraform apply" now.
➜  ecr git:(feat/pipeline) ✗ 
```